{
"About": {
  "Name": "Shewit Yonas",
  "Currently": "Mechanical Engineering Student",
  "Headshot": "pic of me.png",
  "Thumbnail": "student-logo.webp",
  "AboutText": "Hi, I’m Shewit Yonas, a Mechanical Engineering student at Seattle Pacific University with a strong passion for engineering design, problem-solving, and hands-on technical work. I am particularly interested in CAD design, mechanical systems, and engineering analysis, and I enjoy applying engineering principles to real-world challenges.<br><br>With experience working as an engineering intern, an academic tutor, and a student project designer, I have developed a strong foundation in communication, teamwork, and technical design. I thrive in collaborative project environments where I can contribute practical solutions, learn advanced tools, and grow both technically and professionally.<br><br>Outside of academics, I enjoy working on multidisciplinary engineering projects, from prototyping mechanical systems to developing performance models in MATLAB. I am committed to continuous learning, expanding my skillset, and pursuing opportunities that integrate mechanical design, sustainability, and innovation."
},
"Contact": {
  "EMail": "shewityonas367@gmail.com",
  "Phone": "(206) 850-4877",
  "Portfolio": "https://www.github.com",
  "LinkedIn": "https://linkedin.com/in/shewit-yonas",
  "GitHub": "https://shewit-yonas.github.io/experience.html"
},
"Experience": {
  "ExperienceText": "I have built experience across engineering design, CAD modeling, environmental projects, and academic support roles. I enjoy combining technical ability with communication and leadership, and I am actively growing my engineering skillset through internships and hands-on design work.",
  "School": "Seattle Pacific University",
  "Major": "Mechanical Engineering",
  "Graduation": "December 2026",
  "EducationText": "My engineering education includes coursework in system dynamics, thermodynamics, fluid mechanics, CAD, heat transfer, and mechanical design. I maintain a 3.95 GPA and received the Full Tuition Distinguished Scholar Award.",
  "Employment": "",
  "Role": "",
  "EmploymentText": "Furtado & Associates — Engineering Intern (Jun 2025 – Aug 2025): Produced 50+ 2D and 3D CAD drawings using AutoCAD. Drafted and QC-checked parcel maps for Sound Transit projects. Wrote legal descriptions for easements and acquisitions.<br><br>South Seattle College Writing Center — English Tutor (Jan 2023 – Jun 2024): Tutored ELL students in English communication and writing. Coordinated tutor schedules and created targeted writing improvement plans.<br><br>Port of Seattle — Green Jobs Summer Intern (Jul 2022 – Aug 2022): Created a summer youth program on environmental initiatives, performed restoration work including kelp transplantation and ivy removal, and led meetings/interviews with Port staff.",
  "Skills": ["SolidWorks ", "MATLAB ", "AutoCAD Civil 3D ", "Microsoft Office ", "Bluebeam"],
  "Leadership": "",
  "LeadershipText": "National Society of Black Engineers (NSBE) — Vice President (September 2025 — Present): Lead weekly professional development meetings for 20 members, coordinated industry events, organized travel to an out of state conference, and represent NSBE on the board of student leaders of the STEM Building at SPU Student Council",
  "SkillsText": "My technical strengths include mechanical design, CAD modeling, engineering calculations, MATLAB simulation, and technical documentation.",
  "Resume": "Shewit_Yonas_Resume.pdf"  
},
"Project1": {
    "Title": "SolUmbra — Semi-Autonomous Solar Energy Robot",
    "Desc": "Co-developing a solar energy collection robot in a team of five. It features a retractable solar panel array and an actuator-driven lifting system. I'm responsible for CAD modeling, solar panel deployment mechanism development, and motor selection",
    "GitHubRepo": "https://github.com",
    "MainImage": "SolUmbra Concept.png",
    "DetailImages": ["Displacement.png","Interference Detection.png"]
  },
  "Project2": {
    "Title": "Prosthetic Hand Prototype",
    "Desc": "In a team of five, I designed and 3D-printed a functional prosthetic hand prototype including a palm housing, motor mounts, and a full linkage system for natural finger curling and thumb rotation",
    "GitHubRepo": "https://github.com",
    "MainImage": "hand prototype.png",
    "DetailImages": ["cuff.png", "hand cad.png"]
  },
  "Project3": {
    "Title": "Water-Cooled Air Conditioner Prototype & MATLAB Performance Model",
    "Desc": "In a team of three, I built and tested a water-cooled AC prototype using a fan, copper tubing, pump, and ice bath. I also developed a MATLAB model to calculate heat transfer rate, convection coefficients, and system performance.",
    "GitHubRepo": "",
    "MainImage": "matlab code.png",
    "DetailImages": ["matlab graph ex 1.png", "matlab code ex 2.png"]
  },
    "Project4": {
    "Title": "",
    "Desc": "",
    "GitHubRepo": "",
    "MainImage": "",
    "DetailImages": [""],
  },
}
